In [2]:
from sqlalchemy import create_engine
import pandas as pd

In [3]:
database_name = 'scooters'    # Fill this in with your scooter database name

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

Set up is complete, next is the engine

In [4]:
engine = create_engine(connection_string)

The next part is the beginning of the SQL queries

In [5]:
query = '''
SELECT *
FROM INFORMATION_SCHEMA.COLUMNS
WHERE TABLE_NAME = 'scooters'
ORDER BY ORDINAL_POSITION
'''

result = engine.execute(query)
lat = pd.read_sql(query, con = engine)
lat.head()

,table_catalog,table_schema,table_name,column_name,ordinal_position,column_default,is_nullable,data_type,character_maximum_length,character_octet_length,...,is_identity,identity_generation,identity_start,identity_increment,identity_maximum,identity_minimum,identity_cycle,is_generated,generation_expression,is_updatable
0,scooters,public,scooters,pubdatetime,1,None,YES,timestamp without time zone,None,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
1,scooters,public,scooters,latitude,2,None,YES,numeric,None,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
2,scooters,public,scooters,longitude,3,None,YES,numeric,None,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
3,scooters,public,scooters,sumdid,4,None,YES,text,None,1.073742e+09,...,NO,None,None,None,None,None,NO,NEVER,None,YES
4,scooters,public,scooters,sumdtype,5,None,YES,text,None,1.073742e+09,...,NO,None,None,None,None,None,NO,NEVER,None,YES

In [6]:
query = '''
SELECT *
FROM scooters
LIMIT 5;
'''

result = engine.execute(query)
lat = pd.read_sql(query, con = engine)
lat.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-06-12 05:52:13.563,36.157014,-86.774656,Powered775,Powered,83.0,Scooter,0.15,Gotcha
1,2019-06-12 05:52:13.563,35.212984,-97.443879,Powered819,Powered,74.0,Scooter,0.15,Gotcha
2,2019-06-12 05:52:13.563,36.121355,-86.770267,Powered2525,Powered,31.0,Scooter,0.15,Gotcha
3,2019-06-12 05:52:13.563,36.121368,-86.770128,Powered1915,Powered,53.0,Scooter,0.15,Gotcha
4,2019-06-12 05:52:13.563,36.121343,-86.770493,Powered622,Powered,98.0,Scooter,0.15,Gotcha

In [7]:
query2 = '''
SELECT *
FROM trips
LIMIT 20;
'''

result = engine.execute(query2)
lat2 = pd.read_sql(query2, con = engine)
lat2.head()

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-07-27 23:56:41.940,Bird,BRD5312,PoweredXDQEM,5.0,0.000,2019-07-27,23:53:35.243333,2019-07-27,23:58:15.746666,36.1604,-86.7800,36.1597,-86.7826,"[(36.159779, -86.780434), (36.159845, -86.7802...",2019-07-28 05:32:05.253
1,2019-07-27 23:56:41.940,Bird,BRD5311,PoweredCN1TH,5.0,656.168,2019-07-27,23:53:35.513333,2019-07-27,23:58:18.026666,36.1597,-86.7805,36.1591,-86.7823,"[(36.159708, -86.780501), (36.159726, -86.7807...",2019-07-28 05:32:05.223
2,2019-07-27 23:56:41.940,Bird,BRD5321,PoweredY8JRK,17.0,0.000,2019-07-27,23:39:20.450000,2019-07-27,23:56:43.590000,36.1551,-86.7852,36.1543,-86.7805,"[(36.155156, -86.785173), (36.155133, -86.7852...",2019-07-28 05:32:05.523
3,2019-07-27 23:56:41.940,Bird,BRD5314,PoweredBJFJZ,5.0,0.000,2019-07-27,23:51:55.726666,2019-07-27,23:57:14.373333,36.1556,-86.7751,36.1552,-86.7794,"[(36.155659, -86.77502), (36.15563, -86.775137...",2019-07-28 05:32:05.310
4,2019-07-27 23:56:41.940,Bird,BRD5323,PoweredM9UCF,21.0,0.000,2019-07-27,23:37:32.780000,2019-07-27,23:58:15.320000,36.1636,-86.7832,36.1620,-86.7754,"[(36.163684, -86.783132), (36.163779, -86.7831...",2019-07-28 05:32:05.583

- Are there any null values in any columns in either table?
- What date range is represented in each of the date columns? Investigate any values that seem odd.
- Is time represented with am/pm or using 24 hour values in each of the columns that include time?
- What values are there in the sumdgroup column? Are there any that are not of interest for this project?
- What are the minimum and maximum values for all the latitude and longitude columns? Do these ranges make sense, or is there anything surprising?
-What is the range of values for trip duration and trip distance? Do these values make sense? Explore values that might seem questionable.
- Check out how the values for the company name column in the scooters table compare to those of the trips table. What do you notice?

In [8]:
# What is the date range in each of the date columns.   

query4 = '''
SELECT MAX(pubdatetime), MIN(pubdatetime)
FROM scooters;
'''

result = engine.execute(query4)
lat = pd.read_sql(query4, con = engine)
lat.head()

                  max                     min
0 2019-07-31 23:59:57 2019-05-01 00:01:41.247

In [9]:
query5 = '''
SELECT MAX(pubtimestamp), MIN(pubtimestamp)
FROM trips;
'''

result = engine.execute(query5)
lat = pd.read_sql(query5, con = engine)
lat.head()

                  max                     min
0 2019-08-01 07:04:00 2019-05-01 00:00:55.423

The start and end times do not match between the two tables.  They are off.

In [10]:
query6 = '''
SELECT MAX(pubdatetime), MIN(pubdatetime)
FROM scooters
WHERE sumdid = 'Powered9EAJL';
'''
result = engine.execute(query6)
lat = pd.read_sql(query6, con = engine)
lat.head()

                  max                     min
0 2019-05-04 17:05:05 2019-05-01 00:06:41.537

In [11]:
query7 = '''
SELECT MAX(pubtimestamp), MIN(pubtimestamp)
FROM trips
WHERE sumdid = 'Powered9EAJL';
'''
result = engine.execute(query7)
lat = pd.read_sql(query7, con = engine)
lat.head()

                      max                     min
0 2019-05-07 18:03:49.303 2019-05-01 00:00:55.423

The first and last trip for Powered9EAJL do not match between tables.

In [12]:
query8 = '''
SELECT pubdatetime,	latitude, longitude, sumdid, sumdtype, chargelevel, sumdgroup, costpermin, companyname
FROM scooters
WHERE chargelevel IS NULL;
'''

result = engine.execute(query8)
lat = pd.read_sql(query8, con = engine)
lat.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-06-14 17:54:31,36.150237,-86.813099,Powered-72a04621-3a01-05f2-3c9b-abae6d7387ce,Powered,None,Scooter,0.15,Bolt
1,2019-06-14 17:59:32,36.150251,-86.813114,Powered-72a04621-3a01-05f2-3c9b-abae6d7387ce,Powered,None,Scooter,0.15,Bolt
2,2019-06-14 18:04:32,36.150252,-86.813113,Powered-72a04621-3a01-05f2-3c9b-abae6d7387ce,Powered,None,Scooter,0.15,Bolt
3,2019-06-14 18:09:32,36.150252,-86.813112,Powered-72a04621-3a01-05f2-3c9b-abae6d7387ce,Powered,None,Scooter,0.15,Bolt
4,2019-06-14 18:14:32,36.150256,-86.813090,Powered-72a04621-3a01-05f2-3c9b-abae6d7387ce,Powered,None,Scooter,0.15,Bolt

In [13]:
query9 = '''
SELECT pubtimestamp, companyname, triprecordnum, sumdid, tripduration, tripdistance, 
    startdate, starttime, enddate, endtime, startlatitude, startlongitude, endlatitude, endlongitude, triproute, create_dt
FROM trips
WHERE create_dt IS NULL;
'''

result = engine.execute(query9)
lat = pd.read_sql(query9, con = engine)
lat.head()

Empty DataFrame
Columns: [pubtimestamp, companyname, triprecordnum, sumdid, tripduration, tripdistance, startdate, starttime, enddate, endtime, startlatitude, startlongitude, endlatitude, endlongitude, triproute, create_dt]
Index: []

There are nulls in the chargelevel, but that is about it.

What date range is represented in each of the date columns? Investigate any values that seem odd.

It appears that in all are supposed to be in 24 hour format.

What values are there in the sumdgroup column? Are there any that are not of interest for this project?

In [14]:
query10 = '''
SELECT DISTINCT sumdgroup
FROM scooters
'''
result = engine.execute(query10)
lat = pd.read_sql(query10, con = engine)
lat.head()

  sumdgroup
0   bicycle
1   scooter
2   Scooter

There are also bicycles included in this is for scooters.

What are the minimum and maximum values for all the latitude and longitude columns? Do these ranges make sense, or is there anything surprising?

In [15]:
query11 = '''
SELECT MAX(longitude)
FROM scooters
'''
result = engine.execute(query11)
lat = pd.read_sql(query11, con = engine)
lat.head()

   max
0  0.0

In [16]:
query13 = '''
SELECT MAX(latitude)
FROM scooters

'''
result = engine.execute(query13)
lat = pd.read_sql(query13, con = engine)
lat.head()

            max
0  3.609874e+06

In [17]:
query14 = '''
SELECT MIN(longitude)
FROM scooters;
'''
result = engine.execute(query14)
lat = pd.read_sql(query14, con = engine)
lat.head()

         min
0 -97.443879

In [18]:
query15 = '''
SELECT MIN(latitude)
FROM scooters;
'''
result = engine.execute(query15)
lat = pd.read_sql(query15, con = engine)
lat.head()

   min
0  0.0

In [19]:
query16 = '''
SELECT latitude, longitude, sumdid, sumdgroup
FROM scooters
WHERE longitude IN (SELECT MIN(longitude)
FROM scooters)
LIMIT 1;

'''
result = engine.execute(query16)
lat = pd.read_sql(query16, con = engine)
lat.head()

    latitude  longitude      sumdid sumdgroup
0  35.212984 -97.443879  Powered819   Scooter

In [20]:
query17 = '''
SELECT latitude, longitude, sumdid, sumdgroup
FROM scooters
WHERE longitude IN (SELECT MAX(longitude)
FROM scooters)
LIMIT 1;
'''
result = engine.execute(query17)
lat = pd.read_sql(query17, con = engine)
lat.head()

   latitude  longitude       sumdid sumdgroup
0       0.0        0.0  Powered2158   Scooter

It looks like there could be a bike near the equator or at the Prime Meridian, or the GPS is just broken.  And there is another at Oklahoma City Oklahoma.

What is the range of values for trip duration and trip distance? Do these values make sense? Explore values that might seem questionable.

In [21]:
query18 = '''
SELECT MIN(tripduration)
FROM trips
LIMIT 1
'''
result = engine.execute(query18)
lat = pd.read_sql(query18, con = engine)
lat.head()

         min
0 -19.358267

In [22]:
query19 = '''
SELECT MAX(tripduration)
FROM trips
LIMIT 1
'''
result = engine.execute(query19)
lat = pd.read_sql(query19, con = engine)
lat.head()

        max
0  512619.0

There times are not always accurate.  There is one that is negative time, and one that is over 355 days.

What are the min and max distance?

In [23]:
query20 = '''
SELECT MAX(tripdistance)
FROM trips
LIMIT 1
'''
result = engine.execute(query20)
lat = pd.read_sql(query20, con = engine)
lat.head()

            max
0  3.188448e+07

In [24]:
query21 = '''
SELECT MIN(tripdistance)
FROM trips
LIMIT 1
'''
result = engine.execute(query21)
lat = pd.read_sql(query21, con = engine)
lat.head()

          min
0 -20324803.8

The furthest distance is 6,040 miles. The shortest distance is a negative 3,853 miles.

In [25]:
query22 = '''
SELECT sumdid, tripdistance, tripduration, startdate, starttime, enddate,	endtime, startlatitude, startlongitude, endlatitude, endlongitude, triproute, create_dt
FROM trips
WHERE tripdistance in (
    SELECT MAX(tripdistance)
    FROM trips)
LIMIT 1;

'''
result = engine.execute(query22)
lat = pd.read_sql(query22, con = engine)
lat.head()

,sumdid,tripdistance,tripduration,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,Powered2460,3.188448e+07,9.0,2019-07-05,01:18:56,2019-07-05,01:27:56,36.16338,-86.780142,36.16628,-86.778127,"[('0', '0'), ('36.16628', '-86.77813')]",2019-07-06 07:13:12.210

In [26]:
query23 = '''
SELECT sumdid, tripdistance, tripduration, startdate, starttime, enddate,	endtime, startlatitude, startlongitude, endlatitude, endlongitude, triproute, create_dt
FROM trips
WHERE tripdistance in (
    SELECT MIN(tripdistance)
    FROM trips)
LIMIT 1;

'''
result = engine.execute(query23)
lat = pd.read_sql(query23, con = engine)
lat.head()

,sumdid,tripdistance,tripduration,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,PoweredYZL2A,-20324803.8,44.0,2019-07-27,23:14:23.683333,2019-07-27,23:58:23.820000,36.1585,-86.7683,36.126,-86.7892,"[(36.158517, -86.768224), (36.158624, -86.7682...",2019-07-28 05:32:05.610

Powered2460 has weird mileage because the GPS pings at 0,0 lat and long.  PoweredYZK2A just shows negative distance.

In [27]:
outliers = '''
SELECT *
FROM trips
WHERE (tripdistance <= 1 AND tripduration > 5) 
    OR (tripdistance >26400 AND tripduration > 120)
ORDER BY tripdistance
'''

out1 = pd.read_sql(outliers, con=engine)
out1

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-07-27 23:56:41.940,Bird,BRD5324,PoweredYZL2A,44.00000,-2.032480e+07,2019-07-27,23:14:23.683333,2019-07-27,23:58:23.820000,36.158500,-86.768300,36.126000,-86.789200,"[(36.158517, -86.768224), (36.158624, -86.7682...",2019-07-28 05:32:05.610
1,2019-07-25 16:39:39.323,Bird,BRD485,PoweredI4464,9.00000,-1.990092e+07,2019-07-25,16:31:14.886666,2019-07-25,16:40:29.046666,36.146100,-86.782300,36.157200,-86.776600,"[(36.14634, -86.782481), (36.146169, -86.78243...",2019-07-26 05:31:03.980
2,2019-07-26 02:20:01.733,Bird,BRD2398,PoweredVXSZ2,25.00000,-9.337271e+06,2019-07-26,01:55:59.876666,2019-07-26,02:20:39.063333,36.149200,-86.814200,36.149300,-86.814200,"[(36.149286, -86.814144), (36.149341, -86.8141...",2019-07-27 05:30:28.807
3,2019-07-29 21:33:20.407,Bird,BRD1539,Powered4VCCV,6.00000,-7.634515e+05,2019-07-29,21:29:25.016666,2019-07-29,21:34:57.306666,36.156700,-86.765200,36.157000,-86.765200,"[(36.157004, -86.765112)]",2019-07-30 05:31:18.720
4,2019-06-09 20:30:28.920,Bird,BRD3786,PoweredNUASB,10.00000,-5.157480e+05,2019-06-09,20:21:09.820000,2019-06-09,20:31:09.060000,36.165700,-86.777900,36.161600,-86.778800,"[(36.165769, -86.777705), (36.165862, -86.7778...",2019-06-10 05:32:01.647
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
33791,2019-06-14 10:53:43.947,Lyft,LFT646,Powered713485,754.42815,1.237631e+05,2019-06-13,22:19:18.136666,2019-06-14,10:53:43.826666,36.160330,-86.778430,36.125030,-86.774690,"[(36.16033, -86.77843), (36.16006, -86.77847),...",2019-06-15 08:51:51.727
33792,2019-06-24 06:51:32.000,JUMP,JMP2,Powered8d26b649-c9af-505d-a2b1-7f289fa89ae6,1440.00000,2.066592e+05,2019-06-21,16:01:41,2019-06-24,00:53:52,36.152973,-86.783550,36.143887,-86.799610,[],2019-06-26 18:28:33.900
33793,2019-05-20 22:02:08.773,SPIN,SPI304,Powered4567425,1923.00000,2.131529e+05,2019-05-19,13:55:41,2019-05-20,21:58:17,36.153890,-86.794979,36.563954,-87.310677,"[(36.56395417641528, -87.31067726396705), (36....",2019-05-21 08:03:50.840
33794,2019-06-02 05:50:38.117,Lime,LIM1408,PoweredDIOKCEJNO2ZE2,120.40000,2.152238e+05,2019-06-02,03:00:37,2019-06-02,05:01:01,36.160966,-86.778942,36.523999,-87.226165,"[(36.16097, -86.77894), (36.16371, -86.78033),...",2019-06-03 07:37:16.147
33795,2019-06-02 15:13:29.800,SPIN,SPI314,Powered7147041,641.00000,2.304167e+05,2019-06-02,04:29:22,2019-06-02,15:09:24,36.160997,-86.778491,36.628313,-87.305048,"[(36.15839, -86.76854), (36.15839, -86.76854),...",2019-06-03 09:05:21.587

In [28]:
query24 = '''
SELECT COUNT(sumdgroup)
FROM scooters
WHERE sumdgroup = 'bicycle';

'''
result = engine.execute(query24)
lat = pd.read_sql(query24, con = engine)
lat.head()

   count
0  26529

How many companies are there and how many scooters does each company have?

In [29]:
query25 = '''
SELECT companyname, COUNT(sumdid)
FROM scooters
WHERE sumdgroup <> 'bicycle' 
GROUP BY companyname;

'''
result = engine.execute(query25)
companies = pd.read_sql(query25, con = engine)
companies

  companyname     count
0        Bird  12251590
1        Bolt   3477198
2      Gotcha   4679280
3        Jump  21835098
4        Lime  16497732
5        Lyft   9087043
6        Spin   5559573

In [31]:
query26 = '''
SELECT companyname, COUNT(DISTINCT sumdid)
FROM scooters
WHERE sumdgroup <> 'bicycle' 
GROUP BY companyname;

'''
result = engine.execute(query26)
companies = pd.read_sql(query26, con = engine)
companies

  companyname  count
0        Bird   3860
1        Bolt    360
2      Gotcha    224
3        Jump   1210
4        Lime   1818
5        Lyft   1735
6        Spin    805